using System;

namespace ConsoleApp1СтарыйЛифт

{
    
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Лифт\nэто задание займет месяц или больше.");
            Console.ReadKey();

            //двери
            //проверка открытых дверей
            //проверка закрытых дверей
            //открытие дверей
            //закрытие дверей
            //невозможность закрыть дверь (препятствие)

            //кнопки
            //нажата ли кнопка
            //вызов лифта с этажа
            //нажатие кнопки в лифте на этаж ( "1" "2" "3" "..." )
            //спец кнопоки ("стоп" "открыть" "закрыть" "вызов диспечера")

            //движение
            //вверх до "n" этажа
            //вниз до "n" этажа
            //остановка на "n" этаже
            //невозможность движения при открытых дверях

            //время

            //перегруз кабины

            //свет в кабине

        }
    }
}

